{"question": "What type of 'helpful' businesses operate on the basis of the Rochdale Principles that were formulated in 1844?", "chain_of_thought_result": "The Rochdale Principles, formulated by a group of weavers in Rochdale, England, in 1844, laid the foundation for the cooperative movement. These principles emphasize democratic control, member participation, and equitable distribution of profits. Businesses that operate on the basis of these principles are typically cooperatives. \n\nHere are the types of 'helpful' businesses that operate under the Rochdale Principles:\n\n1. **Consumer Cooperatives**: These are owned and operated by the consumers who buy their goods or services. Members have a say in the management and share in the profits based on their purchases.\n\n2. **Worker Cooperatives**: These businesses are owned and self-managed by their workers. Employees have equal voting rights and share in the profits, promoting fair labor practices and job security.\n\n3. **Housing Cooperatives**: These are organizations that provide housing to their members. Members collectively own and manage the property, ensuring affordable housing and community involvement.\n\n4. **Agricultural Cooperatives**: Farmers come together to form cooperatives to process, market, and distribute their products. This helps them gain better prices and access to resources.\n\n5. **Credit Unions**: These are member-owned financial cooperatives that provide savings accounts, loans, and other financial services. They operate on the principle of serving their members rather than maximizing profits.\n\n6. **Health Care Cooperatives**: These organizations provide health services to their members, often focusing on affordable and accessible care while promoting member involvement in decision-making.\n\n7. **Retail Cooperatives**: These businesses are owned by a group of retailers who pool resources to enhance purchasing power and share profits among members.\n\nIn summary, businesses that operate on the basis of the Rochdale Principles are cooperatives that prioritize member ownership, democratic governance, and equitable distribution of benefits."}