{"question": "jawaharlal nehru centre for advanced scientific research jakkur campus", "chain_of_thought_result": "The Jawaharlal Nehru Centre for Advanced Scientific Research (JNCASR) is an autonomous research institution located in Jakkur, Bangalore, India. Here’s a step-by-step breakdown of the information related to it:\n\n1. **Name and Establishment**: The center is named after Jawaharlal Nehru, the first Prime Minister of India. It was established in 1989.\n\n2. **Purpose**: JNCASR aims to promote advanced scientific research and education in various fields of science and engineering.\n\n3. **Location**: The center is situated in Jakkur, a locality in Bangalore, which is known for its educational and research institutions.\n\n4. **Research Areas**: JNCASR conducts research in multiple disciplines, including but not limited to:\n   - Materials Science\n   - Biological Sciences\n   - Chemical Sciences\n   - Physical Sciences\n   - Engineering Sciences\n\n5. **Programs Offered**: The center offers various academic programs, including Ph.D. and integrated Ph.D. programs, and it collaborates with other institutions for research and development.\n\n6. **Facilities**: JNCASR is equipped with state-of-the-art laboratories and facilities to support its research activities.\n\n7. **Collaborations**: The center collaborates with national and international research institutions, fostering a global scientific community.\n\n8. **Publications and Contributions**: Researchers at JNCASR contribute to scientific literature and advancements, often publishing their findings in reputed journals.\n\n9. **Community Engagement**: The center also engages in outreach programs to promote science education and awareness among the public.\n\nIn summary, the Jawaharlal Nehru Centre for Advanced Scientific Research in Jakkur is a prominent institution dedicated to advanced research and education in various scientific fields, contributing significantly to the scientific community in India and beyond."}